Data Birleştirme

In [2]:
import pandas as pd

In [10]:
data_a = {'id': ['1', '2', '3'],
 'first': ['Alex', 'Amy', 'Allen'],
 'last': ['Anderson', 'Ackerman', 'Ali']}

df_a = pd.DataFrame(data_a) #dataframe e çevirme

In [11]:
data_b = {'id': ['4', '5', '6'],
 'first': ['Billy', 'Brian', 'Bran'],
 'last': ['Bonder', 'Black', 'Balwner']}

df_b = pd.DataFrame(data_b) #dataframe e çevirme

In [14]:
concat_df = pd.concat([df_a, df_b], axis = 0) #dataframe leri birleştirme

In [15]:
concat_df.head()

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black

Farklı bir veri tipi

In [20]:
employee_data = {'employee_id': ['1', '2', '3', '4'],
 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
 'Tim Horton']}

In [27]:
employee = pd.DataFrame(employee_data,columns = ['employee_id', 'name'])

In [28]:
sales = {'employee_id': ['3', '4', '5', '6'],
'total_sales': [23456, 2512, 2345, 1455]}

In [31]:
sales = pd.DataFrame(sales_data, columns = ['employee_id','total_sales'])

In [ ]:
pd.merge(employee,sales, on = 'employee_id', how = 'outer') #on = employee_id üzerinden birleştirir ve hiçbir veri kaybetmez.

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0